
{
  "personal": {
    "name": "Sourab Gadipalli",
    "title": "Security Engineer",
"bio": "Cybersecurity graduate from the University of Maryland - College Park, with hands-on experience in cloud security, vulnerability assessment and digital forensics. Skilled in Python scripting, incident response and AWS/Azure security tools. Currently enhancing expertise through the WiCyS Security Training program in preparation for a GIAC certification.",
    "longBio": [
      "Cybersecurity graduate with expertise in cloud infrastructure security, penetration testing, and digital forensics. I specialize in securing AWS and Azure environments, hardening infrastructure, and conducting vulnerability assessments to proactively identify risks.",

"My hands-on experience includes cloud security and penetration testing, backed by professional certifications: AWS Certified Security – Specialty, AWS Solutions Architect, CompTIA Security+, and eJPT (Junior Penetration Tester). I actively participate in Capture The Flag (CTF) competitions and maintain a 90+ day learning streak on TryHackMe to sharpen my skills.",

"I have applied my skills through hands-on projects in malware forensics, penetration testing, compliance audits, and vulnerability assessments, investigating system compromises, identifying security gaps, and providing actionable recommendations to strengthen security postures."
    ],
    "photo": "src/photos/profile.jpeg",
    "contact": {
      "email": "gsourab@terpmail.umd.edu",
      "linkedin": "linkedin.com/in/sourab-gadipalli/",
      "github": "https://github.com/Sourab17"
    }
  },
  "experience": [
  {
    "title": "Analyst-IT",
    "organization": "Merilytics",
    "period": "Feb 2023 – Aug 2023",
    "description": ["Maintained HIPAA compliance across Azure data pipelines, implementing security controls and audit mechanisms for sensitive data.",

    "Designed and deployed Power BI dashboards with role-based access control (RBAC) and data masking, improving data security.",
    
    "Using SQL, DAX, and Excel to build vulnerability tracking reports for monthly security reviews."]
  },
  {
    "title": "Software Engineer",
    "organization": "MAQ Software",
    "period": "Nov 2021 – Oct 2022",
    "description": ["Increased Azure Security Score from 70% to 95% by implementing industry-aligned best practices across resource configurations.",

    "Partnered with the InfoSec team to build and enforce NSG rules and identity management policies.",
    
    "Participated in secure code reviews to assess pull requests and code changes for security standards, performance and best practices.",
    
    "Automated pipeline security checks using Python, reducing mean time to respond (MTTR) to incidents by 30%.",
    
    "Worked across the full SDLC in an Agile environment and deployed ETL workflows and compliance reports using secure CI/CD
pipelines."]
  }
],
  "education":[
  {
    "title": "Master of Engineering Program in Cybersecurity",
    "organization": "University of Maryland, College Park",
    "period": "2023 – 2025",
    "description": "Coursework emphasized hands-on cybersecurity across penetration testing, cloud security, digital forensics, and secure software engineering. Gained practical experience in reconnaissance, exploitation, lateral movement, OWASP Top 10 vulnerabilities, phishing exercises, and vulnerability reporting. Developed strong foundations in cloud security architecture, identity and access management, compliance, and risk mitigation. Built expertise in information assurance, incident response, disk and memory forensics, reverse engineering, and exploitation of C/Unix binaries, along with secure software testing, threat modeling, and network protocols."
  },
  {
    "title": "Bachelor of Technology in Computer Science and Engineering",
    "organization": "CMR College of Engineering and Technology",
    "period": "2017 – 2021",
    "description": "Built a strong foundation in computer science fundamentals including data structures and algorithms, operating systems, computer networks, database systems, web technologies, and compiler design, with hands-on programming and problem-solving experience."
  }
],
  "skills": [
  {
    "category": "Programming & Scripting",
    "items": ["C", "C++", "Python", "PL/SQL", "Bash", "PowerShell"]
  },
  {
    "category": "Cloud Platforms",
    "items": [
      "Amazon Web Services",
      "Microsoft Azure"
    ]
  },
  {
    "category": "Operating Systems",
    "items": ["Windows", "Ubuntu", "Kali Linux", "OpenAI API", "LLMs"]
  },
  {
    "category": "Security Frameworks & Standards",
    "items": ["OWASP TOP 10", "HIPAA", " MITRE ATT&CK"]
  },
  {
    "category": "Offensive Security Tools",
    "items": ["Nmap", "Burp Suite", "Metasploit", "SQLmap", "Hydra", "Ligolo-ng"]
  },
  {
    "category": "Digital Forensics Tools",
    "items": ["Autopsy", "Volatility", "FTK Imager", "Wireshark"]
  },
  {
    "category": "Cloud Security Tools",
    "items": ["AWS GuardDuty", "AWS Config", "AWS Inspector", "AWS WAF", "Microsoft Defender"]
  },
  {
    "category": "Reverse Engineering & Exploitation",
    "items": ["GDB", "pwndbg", "Ghidra", "IDA Pro"]
  }
],
  "projects": [
    {
      "title": "Centralized Log Management System",
      "description": "An AI-driven meal planner using DistilGPT-2 with chatbots for trainers and doctors. Built with FastAPI, NextJS, and NestJS, deployed using Docker and reverse-proxied via NGINX. Provides personalized diet charts, scheduling, and secure cloud-hosted services.",
      "image": "https://images.unsplash.com/photo-1490645935967-10de6ba17061?q=80&w=2070&auto=format&fit=crop",
      "tags": ["Next.js", "NestJS", "Tailwind CSS", "FASTAPI", "Docker", "NGINX", "DistilGPT-2", "Supabase"],
      "link": "http://104.248.229.28/"
    },
    {
      "title": "Securing a Cloud-based (AWS) Healthcare Application",
      "description": "A medical diagnostic tool using a CNN trained on ChestMNIST to predict X-ray outcomes. Deployed with FastAPI backend, Docker containers, and CI/CD pipeline on DigitalOcean. Offers accurate predictions via a clean NextJS frontend.",
      "image": "https://www.heart.org/-/media/Images/Health-Topics/Heart-Attack/Doctor-holding-image-of-chest-xray.jpg?sc_lang=en&hash=111CEF6839D947F2CFBD03C0A0DA1C86",
      "tags": ["React","Next.js", "Tailwind CSS", "FASTAPI", "Docker", "NGINX"],
      "link": "http://34.227.58.67/"
    },
    {
      "title": "Penetration Testing & Vulnerability Assessment",
      "description": "A digital film archive platform with admin review tools and WebSocket-based donor chat. Full-stack build using React, NextJS, NestJS, PostgreSQL, and Docker. Automated deployment on Linode with real-time chat and approval workflows.",
      "image": "https://images.squarespace-cdn.com/content/v1/5c90fe2eaf468307c83acde2/0b0077d9-e016-46d2-9d16-bc3cbf36ecc7/TPXM0lLvzMDIkMqnu9cFZS3ie8rMMNIl1658435216.jpg",
      "tags": ["React Native", "NextJS", "NestJS", "Tailwind CSS", "PostgreSQL", "Docker", "NGINX", "CI/CD"],
      "link": "http://172.232.31.234:3000/"
    },
    {
      "title": "Malware-Infected Hard Drive Forensic Investigation",
      "description": "An LLM-powered coding platform for problem creation, auto-evaluation, and flowchart visualization. Built using NextJS, NestJS, and PostgreSQL with containerized deployment via Docker and CI/CD. Supports multilingual code execution, secure authentication, and scalable contest tracking.",
      "image": "https://leadschool.in/wp-content/uploads/2022/04/shutterstock_1777292972.jpg",
      "tags": ["Next.js", "Framer Motion", "Tailwind CSS", "NestJS", "MongoDB", "Docker", "NGINX","CI/CD"],
      "link": "http://167.172.155.139/dashboard"
    }
  ],
  "achievements": [
  {
    "title": "AWS Certified Security - Specialty",
    "year": "2025",
    "description": "Validated expertise in AWS cloud security, including IAM, encryption, logging and monitoring, threat detection, incident response, and compliance using AWS-native security services."
  },
  {
    "title": "AWS Certified Solutions Architect - Associate",
    "year": "2025",
    "description": "Validated expertise in designing scalable, highly available, and cost-optimized AWS architectures using core compute, storage, networking, and database services."
  },
  {
    "title": "CompTIA Security+",
    "year": "2024",
    "description": "Validated foundational cybersecurity knowledge across network security, risk management, cryptography, access control, and incident response."
  },
  {
    "title": "Junior Penetration Tester (eJPT)",
    "year": "2024",
    "description": "Gained hands-on experience in web and network penetration testing, vulnerability assessment, and ethical hacking techniques."
  }
],
  "navItems": [
    { "label": "About", "id": "about" },
    { "label": "Projects", "id": "projects" },
    { "label": "Experience", "id": "experience" },
    { "label": "Education", "id": "education" },
    { "label": "Skills", "id": "skills" },
    { "label": "Achievements", "id": "achievements" },
    { "label": "Contact", "id": "contact" }
  ]
}
